DataProcessors/Renault_ОбменДаннымиЦвета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ОбменДаннымиЦвета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.Renault_CRM</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ЦветаМоделей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЦветаМоделей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоплатаЗаЦвет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенКорпКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТарифыНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_ИдентификаторыКартинок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ИдентификаторыКартинок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Модели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модели</Name>
			<Comment>Модели автомобили и прочих транспортных средств</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код модели</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование модели автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель модели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаVIN</Name>
					<Comment>Маска VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоработы</Name>
					<Comment>Группа авторабот для данной модели по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Покупатель/комитент, которому производится отгрузка товаров</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТО</Name>
					<Comment>Межсервисный интервал для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТО</Name>
					<Comment>Межсервисный пробег для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантии</Name>
					<Comment>Срок гарантии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТС</Name>
					<Comment>Категория транспортного средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТСКОДД</Name>
					<Comment>Категория транспортного средства согласно "Конвенции о дорожном движении"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельИзКлассификатора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеWA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМодели_Аш_Промис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Comment>Тип транспортного средства (по ПТС)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПриПокупкеВКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПриСтраховании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкикдаПриПокупкеВТрейдИн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаМаксимальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКлассифайда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвтоРуКоммерция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДром</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ДромМодели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТОноль</Name>
					<Comment>Межсервисный интервал ТО-0</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТОноль</Name>
					<Comment>Межсервисный пробег ТО-0</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиОтРРЦдляИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодкатегорияКоммерческогоТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодкатегорииКоммерческогоТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Опции</Name>
					<Comment>Доступные опции для модели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Comment>Опция модели</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена опции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпцииКоммерцияАвтоРу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОпцииКоммерцияАвтоРу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_ОбменДаннымиЦвета/Ext/ObjectModule.bsl
Перем BIR;
Перем СервисФабрика;

//Точка входа
Процедура ОбработкаНаСервере() Экспорт
	BIR =Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	//*//СокрЛП(Renault_ОбщийМодуль.ПолучитьИдентификатор(Организация));
	ПолучитьДанныеИзЦентраль();		
КонецПроцедуры

Процедура ПолучитьДанныеИзЦентраль()Экспорт
	
	Адрес = АдресWS +"ws/colpic.ws";
	Адрес = СтрЗаменить(Адрес, "?wsdl", "");
	ВСОпределение = Новый WSОпределения(СокрЛП(Адрес) + "?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/colors", 
							   "ColorsAndPictures","ColorsAndPicturesSoap12",600);
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	ЦветаМодели = ВебСервис.GetModelsColor(BIR);
	ПолучитьЦветаМодели(ЦветаМодели);
	
	Картинки = ВебСервис.GetPictures(BIR);
	ПолучитьКартинки(Картинки);		
	
	МаркиАвтомобилей =ВебСервис.GetBrandCars(BIR,Истина);
	ПолучитьПредопределенныеМарки(МаркиАвтомобилей);
	
	Инфа = СформироватьИнформацию(СервисФабрика);
	Итог = ВебСервис.SetDCData(BIR,Инфа);
	
КонецПроцедуры

Процедура ПолучитьЦветаМодели(Источник) экспорт
	
	Набор =  РегистрыСведений.Renault_ЦветаМоделей.СоздатьНаборЗаписей();
    Зап = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 0
                       |	Renault_ЦветаМоделей.Модель,
                       |	Renault_ЦветаМоделей.Цвет
                       |ИЗ
                       |	РегистрСведений.Renault_ЦветаМоделей КАК Renault_ЦветаМоделей");
	ТабЗнач = Зап.Выполнить().Выгрузить();
	Для Каждого ТекЗапись Из Источник.Строки Цикл
		Попытка
			Модель = ПолучитьСсылкуМодель(ТекЗапись.Модель);
			Цвет = ПолучитьСсылкуЦвет(ТекЗапись.Цвет);
			Если Не(Модель = Справочники.Модели.ПустаяСсылка())И  Не(Цвет = Справочники.Цвета.ПустаяСсылка())Тогда
				НовСтр = ТабЗнач.Добавить();
				НовСтр.Модель = Модель;
				НовСтр.Цвет = Цвет;						
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Набор.Загрузить(ТабЗнач);
	Набор.Записать();
	
КонецПроцедуры

Процедура ПолучитьКартинки(Источник) экспорт
	
	Для Каждого ТекЗапись Из Источник.Строки Цикл
		Попытка
			Менеджер =  РегистрыСведений.CRM_ИдентификаторыКартинок.СоздатьМенеджерЗаписи();
			Модель = ПолучитьСсылкуМодель(ТекЗапись.Модель);
			ВариантКомплектации = ПолучитьСсылкуМодель(ТекЗапись.ВариантКомплектации);
			Идентификатор = ТекЗапись.Идентификатор;
			Данные = ТекЗапись.Картинка;
			Картинка = Новый Картинка(Данные);
			Цвет = ПолучитьСсылкуЦвет(ТекЗапись.Цвет);
			Если Не(Модель = Справочники.Модели.ПустаяСсылка())И (ЗначениеЗаполнено(Идентификатор))Тогда
				КартинкаСуществует =НайтиСоздатьКартинку(Идентификатор,Модель,Картинка);
				Если КартинкаСуществует Тогда
					Менеджер.Модель = Модель;
					Менеджер.Цвет = Цвет;
					Менеджер.ВариантКомплектации = ВариантКомплектации;
					Менеджер.Прочитать();
					Если НЕ Менеджер.Выбран() Тогда
						Менеджер.Модель = Модель;
						Менеджер.Цвет = Цвет;
						Менеджер.ВариантКомплектации= ВариантКомплектации;
					КонецЕсли;
					Менеджер.Идентификатор = Идентификатор;
					Менеджер.Записать();
                КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция НайтиСоздатьКартинку(Идентификатор,Модель,Картинка)
	Ответ = ложь;
	Зап = Новый Запрос("ВЫБРАТЬ
	                   |	КартинкиИФайлы.Данные
	                   |ИЗ
	                   |	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	                   |ГДЕ
	                   |	КартинкиИФайлы.Объект = &Объект
	                   |	И КартинкиИФайлы.Идентификатор = &Идентификатор");	
	Зап.УстановитьПараметр("Объект",Модель);
	Зап.УстановитьПараметр("Идентификатор",Идентификатор);
	Рез= Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Мен = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		Мен.Объект = Модель;
		Мен.Идентификатор = Идентификатор;
		Мен.Прочитать();
		Если НЕ Мен.Выбран() тогда
			Попытка
			  	Мен.Объект = Модель;
				Мен.Идентификатор = Идентификатор;
				Мен.Данные = Новый ХранилищеЗначения(Картинка);
				Мен.Картинка = Истина;
				Мен.ДатаСохранения = ТекущаяДата();
				Мен.ДанныеВоВнешнемФайле = Ложь;
				мен.Записать();
				Ответ = Истина;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		Ответ = Истина;
	КонецЕсли;
	Возврат Ответ;
		
КонецФункции

Функция ПолучитьСсылкуМодель(Артикул)
	Попытка
		Рез = Справочники.Модели.НайтиПоРеквизиту("Артикул",Артикул);
	Исключение
		Рез = Справочники.Модели.ПустаяСсылка();
	КонецПопытки;
	Возврат рез;
КонецФункции

Функция ПолучитьСсылкуЦвет(ДанныеЦвет)
	
	Если ЗначениеЗаполнено(ДанныеЦвет.Артикул) И (НЕ(ДанныеЦвет.Артикул ="-1")) Тогда
		ЦветСсылка = Справочники.Цвета.НайтиПоРеквизиту("Артикул", ДанныеЦвет.Артикул);
		Если ЦветСсылка = Справочники.Цвета.ПустаяСсылка()Тогда
			Попытка
				//Создадим новый элемент
				ЦветОбъект = Справочники.Цвета.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(ЦветОбъект, ДанныеЦвет);
				ЦветОбъект.УстановитьНовыйКод();
				ЦветОбъект.Записать();
				ЦветСсылка = ЦветОбъект.Ссылка;
			Исключение
				ЦветСсылка = Справочники.Цвета.ПустаяСсылка();
			КонецПопытки;
		Иначе
			Попытка
				//Дополним текущий
				ЦветОбъект = ЦветСсылка.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ЦветОбъект, ДанныеЦвет);
				ЦветОбъект.Записать();
				ЦветСсылка = ЦветОбъект.Ссылка;
			Исключение
				//Ничего
			КонецПопытки;
		КонецЕсли;
	Иначе
		ЦветСсылка = Справочники.Цвета.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ЦветСсылка;
	
КонецФункции

Функция ПолучитьСсылкуВариантКомплектации(Артикул)
	Попытка
		Рез = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул",Артикул);
	Исключение
		Рез = Справочники.ВариантыКомплектации.ПустаяСсылка();
	КонецПопытки;
	Возврат рез;
	
КонецФункции

Процедура ПолучитьПредопределенныеМарки(Марки)экспорт
	ОбъектМарка = Справочники.CRM_МаркаАвтомобиля.RENAULT.ПолучитьОбъект();
	ОбъектМарка.МоделиАвтомобилей.Очистить();
	ОбъектМарка.МоделиАвтомобилейКоммерческоеПредложение.Очистить();
	ОбъектМарка.МоделиАвтомобилейПервичныйИнтерес.Очистить();

	Для Каждого Марка из Марки.Строки Цикл
		Для Каждого ТекМодель Из Марка.МоделиАвтомобилей Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилей.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекМодель Из Марка.МоделиАвтомобилейКП Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилейКоммерческоеПредложение.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
        Для Каждого ТекМодель Из Марка.МоделиАвтомобилейПИ Цикл
			Модель = ПолучитьСсылкуМодель(ТекМодель);
			Если НЕ(Модель = Справочники.Модели.ПустаяСсылка())Тогда
				НовСтр = ОбъектМарка.МоделиАвтомобилейПервичныйИнтерес.Добавить();
				новСтр.Модель = Модель;
			КонецЕсли;
		КонецЦикла;
        		
	КонецЦикла;
	ОбъектМарка.Записать();
КонецПроцедуры

Функция СформироватьИнформацию(Фабрика) экспорт
	Ответ  = Фабрика.Создать(Фабрика.Тип("http://renault-nissan.com/schema/colors","ИнформацияОДц"));
	Ответ.BIR = BIR;
	Ответ.ВерсияАА = Метаданные.Версия;
	Ответ.ВерсияCRM = Константы.CRM_Версия_Renault.Получить();
	Возврат Ответ;
КонецФункции

АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
//АдресWS	 ="http://test-dms-server/FROLOV-CENTRAL/";  //для тестирования в локальной центральной базе 
ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
